In [1]:
import pandas as pd

In [2]:
#Data loading
file_path = "Resources/shopping_data.csv"
df_shopping  = pd.read_csv(file_path, encoding="ISO-8859-1")
df_shopping.head(5)

   CustomerID Card Member   Age  Annual Income  Spending Score (1-100)
0           1         Yes  19.0          15000                    39.0
1           2         Yes  21.0          15000                    81.0
2           3          No  20.0          16000                     6.0
3           4          No  23.0          16000                    77.0
4           5          No  31.0          17000                    40.0

In [3]:
# Columns
df_shopping.columns

Index(['CustomerID', 'Card Member', 'Age', 'Annual Income',
       'Spending Score (1-100)'],
      dtype='object')

In [4]:
# list dataframe data types
df_shopping.dtypes

CustomerID                  int64
Card Member                object
Age                       float64
Annual Income               int64
Spending Score (1-100)    float64
dtype: object

In [6]:
# find null values
for  column  in  df_shopping.columns:
    print(f"Column  {column} has {df_shopping[column].isnull().sum()}null values")

Column  CustomerID has 0null values
Column  Card Member has 2null values
Column  Age has 2null values
Column  Annual Income has 0null values
Column  Spending Score (1-100) has 1null values

In [7]:
# Drop null rows
df_shopping = df_shopping.dropna()

In [8]:
#find duplicate entries
print(f"Duplicate entires: {df_shopping.duplicated().sum()}")

Duplicate entires: 0

In [9]:
#remove the customerID column
df_shopping.drop(columns=["CustomerID"],inplace=True)
df_shopping.head()

  Card Member   Age  Annual Income  Spending Score (1-100)
0         Yes  19.0          15000                    39.0
1         Yes  21.0          15000                    81.0
2          No  20.0          16000                     6.0
3          No  23.0          16000                    77.0
4          No  31.0          17000                    40.0

In [11]:
# Transfrom string  column
def  change_string(member):
    if member == "Yes":
        return 1
    else:
        return 0
df_shopping["Card  Member"] = df_shopping["Card Member"].apply(change_string)
df_shopping.head()

  Card Member   Age  Annual Income  Spending Score (1-100)  Card  Member
0         Yes  19.0          15000                    39.0             1
1         Yes  21.0          15000                    81.0             1
2          No  20.0          16000                     6.0             0
3          No  23.0          16000                    77.0             0
4          No  31.0          17000                    40.0             0

In [12]:
# Transform annual income
df_shopping["Annual  Income"] = df_shopping["Annual Income"]/1000
df_shopping.head()

,Card Member,Age,Annual Income,Spending Score (1-100),Card Member,Annual Income
0,Yes,19.0,15000,39.0,1,15.0
1,Yes,21.0,15000,81.0,1,15.0
2,No,20.0,16000,6.0,0,16.0
3,No,23.0,16000,77.0,0,16.0
4,No,31.0,17000,40.0,0,17.0

In [13]:
# Saving cleaned data
file_path = "Resources/shopping_data_cleaned.csv"
df_shopping.to_csv(file_path, index=False)